app/Controllers/Login.php

SELECT *
FROM `members`
WHERE `email` = 'gift@gmail.com'
 LIMIT 1
---
    $membersModel = new MembersModel();

    // Check if the user exists
    $user = $membersModel->where('email', $formData['email'])->first();