app/Controllers/Profile.php

SELECT *
FROM `members`
WHERE `members`.`id` = '34'
---
    public function index($id = null)
    {
        $page = new \stdClass();
        $page->title = 'Dashboard';

        // Start the session and check if it's valid
        $session = session();

        // Check if the session is expired
        $userId = $session->get('user_id');

        // Update the last activity time
        $session->set('last_activity', time());

        // Use the user ID from the route if provided, otherwise get it from the session
        $userId = $id ?? $session->get('user_id'); // Ensure this matches the session key

        // Load the MembersModel
        $membersModel = new MembersModel();

        // Fetch user data by ID
        $user = $membersModel->find($userId);