app/Controllers/Register_Apart.php

        unset($formData['confirm-password']);

        $membersModel = new MembersModel();
        $affected = $membersModel->insert($formData);
---
INSERT INTO `members` (`firstname`, `lastname`, `email`, `phone`, `password`) VALUES ('Gift', 'Mary', 'gift@gmail.com', '08012345678', '$2y$10$89d52PuSLLqy8QYj8UBf3emKgFT44MZ2jzxl9yAqwGkH5ytJEtGFG')